app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
  <%= f.label :delegated_id %><br>
  <%= f.select :delegated_id, User.all.collect {|u| [ u.username, u.id ] }, { :include_blank => true, :selected => @task.delegated_id}, class: "form-control" %>