app/views/tasks/index.html.erb

SELECT "tasks".* FROM "tasks"
---
<%= link_to 'New Task', new_task_path, class: "btn btn-success btn-sm" %>
<h2>Todo (<%= pluralize(@todo.count, "Task") %>, <%= pluralize(@todo.sum("duration"), "Hour") %>)</h2>