app/controllers/projects_controller.rb

	def create
		@project = Project.new(project_params)
		if !@project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 21 Jan 2014 07:36:52 UTC +00:00], ["name", "hallo"], ["updated_at", Tue, 21 Jan 2014 07:36:52 UTC +00:00]]