app/controllers/tasks_controller.rb

  def index
   if params[:sorting]
  @done = Task.where(done: true).order(params[:sorting] => :desc)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."done" = 't' ORDER BY "tasks"."created_at" DESC

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("created_at", "deadline", "done", "duration", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = 2  [["done", true], ["updated_at", Tue, 10 Dec 2013 12:00:41 UTC +00:00]]